frontend/controllers/PersonController.php

    protected function findModel($id)
    {
        if (($model = Person::findOne($id)) !== null) {
---
SELECT * FROM `shop_person` WHERE `uid`='1'