supplier/views/goods/view.php

                        ],
                        [
                            'attribute' => 'service_cid',
                            'value' => ServiceCategory::findOne($model->service_cid)->name
                        ],
                        [
                            'attribute' => 'type_id',
                            'value' => ServiceType::findOne($model->type_id)->name
                        ],
                        [
                            'attribute' => 'attri_id',
                            'value' => Attribute::findOne($model->attri_id)->name
---
SELECT * FROM `shop_service_category` WHERE `id`=1
SELECT * FROM `shop_service_type` WHERE `id`=1
SELECT * FROM `shop_attribute` WHERE `id`=2