common/models/CompanyReg.php

SELECT * FROM `shop_company_reg` WHERE `id`=5
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);

SELECT * FROM `shop_company_reg` WHERE `username`='123456'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);