common/models/Image.php

SELECT * FROM `shop_image` WHERE `id`=35
---
    public static function getImage($id)
    {
        if(!$id){
            return '';
        }
        $imageDomain = Yii::getAlias("@imageDomain");
        $model = static::findOne($id);