supplier/views/customorder/_search.php


    <?= $form->field($model, 'status', ['template' => '{input}'])->dropDownList(['0'=>'未处理','10'=>'以处理'],['prompt'=>'状态']) ?>

    <?= $form->field($model, 'cate_id', ['template' => '{input}'])->dropDownList(
        ArrayHelper::map(ServiceCategory::findAll(['status'=>10]),'id' ,'name' ),
        ['prompt'=>'服务分类', 'onchange' => '
            var url = "' . Url::toRoute('/customorder/type') . '";
            var id = $(this).val();
            $.post(url, {id : id}, function(data){
                $("#customordersearch-type_id").html(data);
            })'
    ]) ?>
---
SELECT * FROM `shop_service_category` WHERE `status`=10