supplier/models/Attribute.php

SELECT * FROM `shop_order` WHERE `id`=1
SELECT * FROM `shop_attribute` WHERE `type_id`=1
---
    public static function getAttrname($order_id)
    {
        $data = Order::findOne($order_id);
        $arr = static::findOne(['type_id'=>$data->type_id]);