supplier/models/Person.php

    public static function getUsername($order_id)
    {
        $data = Order::findOne($order_id);
        $arr = static::findOne(['uid'=>$data->uid]);
---
SELECT * FROM `shop_order` WHERE `id`=1
SELECT * FROM `shop_person` WHERE `uid`=1