supplier/models/ServiceCategory.php

    public static function getCatename($order_id)
    {
        $data = Order::findOne($order_id);
        $arr = static::findOne($data->type_id);
---
SELECT * FROM `shop_order` WHERE `id`=1
SELECT * FROM `shop_service_category` WHERE `id`=1