supplier/models/ServiceType.php

SELECT * FROM `shop_order` WHERE `id`=1
SELECT * FROM `shop_service_type` WHERE `id`=1
---
    public static function getName($id)
    {
        $data = Order::findOne($id);
        $arr = static::findOne($data->type_id);