backend/models/Admin.php

SELECT * FROM `shop_admin` WHERE (`id`=1) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);