frontend/models/SignupForm.php

INSERT INTO `shop_user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('admin', '1847091580@qq.com', '$2y$13$t0mXDxdczUGRD.IBZfoFheoAL4XoCKkXktrDhKXvZiCK.5CSazJXy', 'IuQ5OBdh0pI74EjuMP-iAc1ghOE_c2Oy', 10, 1463477368, 1463477368)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->created_at = time();
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;