backend/modules/weixin/controllers/KeywordController.php

SELECT COUNT(*) FROM `shop_keyword`
SELECT * FROM `shop_keyword` LIMIT 10
---
    public function actionIndex()
    {
        $searchModel = new KeywordSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        //调用模型
        $query = Keyword::find();
        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count()
        ]);
        $data = $query->limit($pagination->limit)
            ->offset($pagination->offset)
            ->all();