backend/modules/weixin/controllers/WxmenuController.php

    public function actionIndex()
    {
        $searchModel = new WxmenuSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $query = Wxmenu::find();
        $pagination = new Pagination([
            'defaultPageSize' => 10,
            'totalCount' => $query->count()
        ]);

        $data = $query->limit($pagination->limit)
            ->offset($pagination->offset)
            ->orderBy('superior')
            ->all();
---
SELECT COUNT(*) FROM `shop_wxmenu`
SELECT * FROM `shop_wxmenu` ORDER BY `superior` LIMIT 10