supplier/views/ordercompany/index.php

                            'label' => '订单号',
                            'attribute' => 'order_id',
                            'value' => function($model){
                                $data = Order::findOne($model->order_id);return $data->order_sn;
---
SELECT * FROM `shop_order` WHERE `id`=1

                            'label' => '价格',
                            'attribute' => 'order_id',
                            'value' => function($model){
                                $data = Order::findOne($model->order_id);return $data->price;
---
SELECT * FROM `shop_order` WHERE `id`=1