supplier/views/ordercompany/view.php

                        [
                            'label' => '订单号',
                            'attribute' => 'order_id',
                            'value' => Order::findOne($model->order_id)->order_sn,
---
SELECT * FROM `shop_order` WHERE `id`=1

                            'label' => '商品ID',
                            'attribute' => 'order_id',
                            'format' => 'raw',
                            'value' => Order::findOne($model->order_id)->id.Html::a("查看", ['goods/view','id'=>Order::findOne($model->order_id)->id], ['class' => 'col-sm-offset-1']),
---
SELECT * FROM `shop_order` WHERE `id`=1