supplier/controllers/GoodsController.php

SELECT * FROM `shop_goods` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Goods::findOne($id)) !== null) {