supplier/controllers/OrdercompanyController.php

    protected function findModel($id)
    {
        if (($model = OrderCompany::findOne($id)) !== null) {
---
SELECT * FROM `shop_order_company` WHERE `id`='7'