supplier/controllers/PersonController.php

    public function actionCview($uid)
    {
        return $this->render('cview', [
            'model' => Person::findOne(['uid'=>$uid]),
        ]);
---
SELECT * FROM `shop_person` WHERE `uid`='1'