supplier/controllers/SiteController.php

SELECT * FROM `shop_company_reg` WHERE `id`=5
---
        public function actionUpsignup(){
        $model = CompanyReg::findOne(Yii::$app->user->identity->id);